### Introduction

In [1]:
%%capture
%load_ext sql

In [2]:
%sql sqlite:///factbook.db

'Connected: @factbook.db'

### Explore Table

In [4]:
%%sql
SELECT * FROM facts LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### Summary Statistic

In [6]:
%%sql
SELECT 
MAX(area) AS max_area,
MIN(area) AS min_area,
AVG(area) AS avg_area
FROM facts;

 * sqlite:///factbook.db
Done.

[(17098242, 0, 555093.546184739)]

In [44]:
%%sql
SELECT 
MAX(area_land) AS max_area_land,
MIN(area_land) AS min_area_land,
AVG(area_land) AS avg_area_land
FROM facts;

 * sqlite:///factbook.db
Done.

[(16377742, 0, 522702.57723577233)]

In [45]:
%%sql
SELECT 
MAX(area_water) AS max_area_water,
MIN(area_water) AS min_area_water,
AVG(area_water) AS avg_area_water
FROM facts;

 * sqlite:///factbook.db
Done.

[(891163, 0, 19067.59259259259)]

### Viewing the country with the largest area and the lowest area

In [14]:
%%sql
SELECT *
FROM facts
WHERE area=(SELECT MAX(area) FROM facts)
OR area=(SELECT MIN(area) FROM facts WHERE area!=0);

 * sqlite:///factbook.db
Done.

[(117, 'mn', 'Monaco', 2, 2, 0, 30535, 0.12, 6.65, 9.24, 3.83),
 (143, 'rs', 'Russia', 17098242, 16377742, 720500, 142423773, 0.04, 11.6, 13.69, 1.69)]

In [13]:
%%sql
SELECT *
FROM facts
WHERE area_land=(SELECT MAX(area_land) FROM facts)
OR 
area_land=(SELECT MIN(area_land) FROM facts WHERE area_land!=0 );

 * sqlite:///factbook.db
Done.

[(117, 'mn', 'Monaco', 2, 2, 0, 30535, 0.12, 6.65, 9.24, 3.83),
 (143, 'rs', 'Russia', 17098242, 16377742, 720500, 142423773, 0.04, 11.6, 13.69, 1.69)]

In [17]:
%%sql
SELECT *
FROM facts
WHERE area=(SELECT MAX(area) FROM facts)
OR area_land=(SELECT MAX(area_land) FROM facts);

 * sqlite:///factbook.db
Done.

[(143, 'rs', 'Russia', 17098242, 16377742, 720500, 142423773, 0.04, 11.6, 13.69, 1.69)]

### Viewing the country with the largest area of land and the largest area of water

In [46]:
%%sql
SELECT *
FROM facts
WHERE area_land=(SELECT MAX(area_land) FROM facts)
OR area_water=(SELECT MAX(area_water) FROM facts);

 * sqlite:///factbook.db
Done.

[(32, 'ca', 'Canada', 9984670, 9093507, 891163, 35099836, 0.75, 10.28, 8.42, 5.66),
 (143, 'rs', 'Russia', 17098242, 16377742, 720500, 142423773, 0.04, 11.6, 13.69, 1.69)]

In [19]:
%%sql
SELECT *
FROM facts
WHERE area_water=(SELECT MAX(area_water) FROM facts)

 * sqlite:///factbook.db
Done.

[(32, 'ca', 'Canada', 9984670, 9093507, 891163, 35099836, 0.75, 10.28, 8.42, 5.66)]

### The percentage of the land area in Canada

In [34]:
%%sql
SELECT id,name, CAST(area_land as float)/CAST(area as float) *100  AS per_area_land
FROM facts
WHERE name='Canada'

 * sqlite:///factbook.db
Done.

[(32, 'Canada', 91.07468749593126)]

### The percentage of the water area in Canada

In [37]:
%%sql
SELECT id,name, CAST(area_water as float)/CAST(area as float) *100  AS per_area_water
FROM facts
WHERE name='Canada'

 * sqlite:///factbook.db
Done.

[(32, 'Canada', 8.925312504068737)]

### The percentage of the land area in Russia

In [38]:
%%sql
SELECT id,name, CAST(area_land as float)/CAST(area as float) *100  AS per_area_land
FROM facts
WHERE name='Russia'

 * sqlite:///factbook.db
Done.

[(143, 'Russia', 95.78611649080648)]

### The percentage of the water area in Russia

In [39]:
%%sql
SELECT id,name, CAST(area_water as float)/CAST(area as float) *100  AS per_area_water
FROM facts
WHERE name='Russia'

 * sqlite:///factbook.db
Done.

[(143, 'Russia', 4.2138835091935185)]

### The largest percentage of the Country of the land area and the water area

In [41]:
%%sql
SELECT id,name, CAST(area_water as float)/CAST(area as float) *100  AS per_area_water
FROM facts
ORDER BY per_area_water DESC
LIMIT 5

 * sqlite:///factbook.db
Done.

[(228, 'British Indian Ocean Territory', 99.88970588235294),
 (247, 'Virgin Islands', 81.8848167539267),
 (246, 'Puerto Rico', 35.6826916104706),
 (12, 'Bahamas, The', 27.881844380403457),
 (71, 'Guinea-Bissau', 22.15916955017301)]

In [43]:
%%sql
SELECT id,name, CAST(area_land as float)/CAST(area as float) *100  AS per_area_land
FROM facts
ORDER BY per_area_land DESC
LIMIT 10

 * sqlite:///factbook.db
Done.

[(1, 'Afghanistan', 100.0),
 (3, 'Algeria', 100.0),
 (4, 'Andorra', 100.0),
 (5, 'Angola', 100.0),
 (6, 'Antigua and Barbuda', 100.0),
 (13, 'Bahrain', 100.0),
 (15, 'Barbados', 100.0),
 (20, 'Bhutan', 100.0),
 (33, 'Cabo Verde', 100.0),
 (34, 'Central African Republic', 100.0)]

In [48]:
%%sql
SELECT 
SUM(area) AS total_area,
SUM(area_land) AS total_area_land,
SUM(area_water) AS total_area_water
FROM facts

 * sqlite:///factbook.db
Done.

[(138218293, 128584834, 4633425)]

### Above the result output, it can be seen that more area of land is covered than area of water on the world.